{"ru":{"name":"querystring","examples":[],"description":"<h1 id=\"querystring\"><a href=\"#querystring\" class=\"anchor\"></a>querystring</h1>\n<p>Блок <code>querystring</code> служит для работы с адресной строкой браузера – обработки и формирования запросов.</p>\n<p>Блок реализован в технологии <code>vanila.js</code> и подходит для использования как на клиенте, так и на сервере.</p>\n<h2 id=\"Публичные-методы-блока-3\"><a href=\"#Публичные-методы-блока-3\" class=\"anchor\"></a>Публичные методы блока</h2>\n<h3 id=\"parse\"><a href=\"#parse\" class=\"anchor\"></a><code>parse</code></h3>\n<p>Метод служит для формирования объекта на основании параметров запроса адресной строки. </p>\n<p>Метод принимает на вход строку с параметрами и возвращает сформированный объект. Параметры передаются в виде пар ключ-значение с символом <code>=</code> в качестве разделителя. Пары отделяются символом <code>&amp;</code>. В ходе работы метода, ключи и значения декодируются из формата URI;</p>\n<h3 id=\"stringify\"><a href=\"#stringify\" class=\"anchor\"></a><code>stringify</code></h3>\n<p>Метод служит для формирования строки запроса с набором параметров на основании собственных свойств объекта. </p>\n<p>На вход метод принимает объект и возвращает сформированную строку запроса. В строке имена свойств отделяются от значений символом <code>=</code>, пары разделяются символом <code>&amp;</code>. </p>\n<h2 id=\"Элементы-блока-1\"><a href=\"#Элементы-блока-1\" class=\"anchor\"></a>Элементы блока</h2>\n<h3 id=\"__uri\"><a href=\"#__uri\" class=\"anchor\"></a>__uri</h3>\n<p>Элемент предназначен для декодирования строки из формата URI. </p>\n<p>Элемент предоставляет следующий набор публичных методов:</p>\n<ul>\n<li><code>decodeURI</code> – декодирование URI. Заменяет каждую последовательность экранирования в строке URI соответствующим символом. Метод поддерживает тот же набор последовательностей, что и стандартный метод JavaScript <code>encodeURI</code>. Символ <code>#</code> не декодируется.</li>\n<li><code>decodeURIComponent</code> – декодирование компонента URI. Заменяет каждую последовательность экранирования в строке URI соответствующим символом. Метод позволяет декодировать компонент URI, сформированный методом <code>encodeURIComponent</code>. Декодируются последовательности, соответствующие символам <code>&amp;</code>, <code>+</code>, и <code>=</code>.</li>\n</ul>\n<p>Оба метода являются оберткой над соответствующими стандартными методами JavaScript <code>decodeURI</code> и <code>decodeURIComponent</code>. </p>\n<p>В ходе работы методов производится проверка входной строки на:</p>\n<ul>\n<li>соответствие формата переданной строки UTF-8. При несоответствии генерируется ошибка.</li>\n<li>наличие последовательностей экранирования. Если последовательности не найдены методы возвращают строку без изменений.</li>\n</ul>\n"},"en":{"name":"querystring","examples":[],"description":""}}