{"ru":{"name":"querystring","examples":[],"description":"<h1 id=\"querystring\"><a href=\"#querystring\" class=\"anchor\"></a>querystring</h1>\n<p>Блок <code>querystring</code> служит для работы с адресной строкой браузера – обработки и формирования запросов.</p>\n<p>Блок реализован в технологии <code>vanilla.js</code> и подходит для использования в серверных и клиентских приложениях.</p>\n<h2 id=\"Публичные-методы-блока\"><a href=\"#Публичные-методы-блока\" class=\"anchor\"></a>Публичные методы блока</h2>\n<p>Блок предоставляет следующий набор публичных методов:</p>\n<ul>\n<li><code>parse</code> – служит для формирования объекта на основании параметров запроса адресной строки. Метод принимает на вход строку с параметрами и возвращает сформированный объект. Параметры передаются в виде пар ключ-значение с символом <code>=</code> в качестве разделителя. Пары отделяются символом <code>&amp;</code>. В ходе работы метода, ключи и значения декодируются из формата <code>URI</code>;</li>\n<li><code>stringify</code> – служит для формирования строки запроса с набором параметров на основании собственных свойств объекта. Метод принимает на вход объект и возвращает сформированную строку запроса. Имена свойств отделяются от значений символом <code>=</code>, пары разделяются символом <code>&amp;</code>. </li>\n</ul>\n<h2 id=\"Элементы-блока\"><a href=\"#Элементы-блока\" class=\"anchor\"></a>Элементы блока</h2>\n<h3 id=\"__uri\"><a href=\"#__uri\" class=\"anchor\"></a>__uri</h3>\n<p>Элемент предназначен для декодирования строки из формата <code>URI</code>. </p>\n<p>Элемент предоставляет следующий набор публичных методов:</p>\n<ul>\n<li><code>decodeURI</code> – декодирование <code>URI</code>. Заменяет каждую эскейпинговую последовательность в строке <code>URI</code> соответствующим символом. Метод поддерживает тот же набор последовательностей, что и стандартный метод JavaScript <code>encodeURI</code>. Символ <code>#</code> не декодируется.</li>\n<li><code>decodeURIComponent</code> – декодирование компонента <code>URI</code>. Заменяет каждую эскейпинговую последовательность в строке <code>URI</code> соответствующим символом. Метод позволяет декодировать компонент <code>URI</code>, сформированный методом <code>encodeURIComponent</code>. Декодируются последовательности, соответствующие символам <code>&amp;</code>, <code>+</code>, и <code>=</code>.</li>\n</ul>\n<p>Оба метода являются оберткой над соответствующими стандартными методами JavaScript <code>decodeURI</code> и <code>decodeURIComponent</code>. В ходе их работы производится проверка входной строки:</p>\n<ul>\n<li>если передана строка в формате, отличном от <code>UTF8</code>, генерируется ошибка;</li>\n<li>если в строке не были найдены эскейпинговые последовательности методы возвращают ее без изменений.</li>\n</ul>\n"},"en":{"name":"querystring","examples":[],"description":""}}